Repository: uykamera653-jpg/Bingoo
Catalog: lib/l10n/app_*.arb
Languages: ru, uz

# hero_title
source: Lost or found? Leave an announcement.
ru: Потеряли или нашли? Оставьте объявление.
uz: Yo‘qotdingizmi yoki topdingizmi? E’lon qoldiring.

# hero_sub
source: “Honesty is the greatest reward.”
ru: «Честность — лучшая награда.»
uz: “Halollik — eng katta mukofot.”

# btn_lost
source: ❗ Lost
ru: ❗ Потерял
uz: ❗ Yo‘qotdim

# btn_found
source: ✅ Found
ru: ✅ Нашёл
uz: ✅ Topdim

# btn_lostlist
source: 📋 Lost items
ru: 📋 Потерянные
uz: 📋 Yo‘qotilganlar

# btn_reward
source: 🎁 Rewarded
ru: 🎁 С наградой
uz: 🎁 Mukofotli

# btn_foundlist
source: 🔎 Found items
ru: 🔎 Найденные
uz: 🔎 Topilganlar

# btn_mine
source: ⭐ My announcements
ru: ⭐ Мои объявления
uz: ⭐ Mening e’lonlarim

# why_title
source: Why BINGO?
ru: Почему BINGO?
uz: Nega BINGO?

# why_text
source: Simple form, quick result. All announcements in one place.
ru: Простая форма, быстрый результат. Все объявления в одном месте.
uz: Oddiy forma, tez natija. Barcha e’lonlar bir joyda.

# guide_title
source: Quick guide
ru: Краткое руководство
uz: Qisqa yo‘riqnoma

# guide_1
source: ❗ Fill out the 'Lost' or ✅ 'Found' form
ru: ❗ Заполните форму 'Потерял' или ✅ 'Нашёл'
uz: ❗ Yo‘qotdim yoki ✅ Topdim formasini to‘ldiring

# guide_2
source: City and contact — required
ru: Город и контакт — обязательно
uz: Shahar va aloqa — majburiy

# guide_3
source: If a reward is listed, it appears in a separate section
ru: Если указана награда, она отображается в отдельном разделе
uz: Mukofot yozilsa, alohida bo‘limda ko‘rinadi

# lost_form_title
source: Lost — announcement
ru: Потерял — объявление
uz: Yo‘qotdim — e’lon

# found_form_title
source: Found — announcement
ru: Нашёл — объявление
uz: Topdim — e’lon

# lost_list_title
source: 📋 All lost items
ru: 📋 Все потерянные
uz: 📋 Umumiy yo‘qotilganlar

# reward_list_title
source: 🎁 Rewarded
ru: 🎁 С наградой
uz: 🎁 Mukofotli

# found_list_title
source: 🔎 Found items
ru: 🔎 Найденные
uz: 🔎 Topilganlar

# mine_title
source: ⭐ My announcements
ru: ⭐ Мои объявления
uz: ⭐ Mening e’lonlarim

# btn_delete_mine
source: Delete my announcements
ru: Удалить мои объявления
uz: Mening e’lonlarimni o‘chirish

# chat_title
source: Message
ru: Сообщение
uz: Xabar

# btn_send
source: Send
ru: Отправить
uz: Yuborish

# btn_submit
source: Submit announcement
ru: Подать объявление
uz: E’lon berish

# confirm_del
source: Delete this announcement? This action cannot be undone.
ru: Удалить это объявление? Это действие нельзя отменить.
uz: Ushbu e’lonni o‘chirilsinmi? Bu amalni qaytarib bo‘lmaydi.

# lbl_item
source: Item
ru: Предмет
uz: Narsa

# lbl_city
source: City/Region
ru: Город/Регион
uz: Shahar/Hudud

# lbl_place
source: Place
ru: Место
uz: Joy

# lbl_date
source: Date/Time
ru: Дата/Время
uz: Sana/Vaqt

# lbl_contact
source: Contact
ru: Контакт
uz: Aloqa

# lbl_reward
source: Reward (optional)
ru: Награда (необязательно)
uz: Mukofot (ixt.)

# lbl_notes
source: Additional
ru: Дополнительно
uz: Qo‘shimcha

# lbl_photo
source: Photo
ru: Фото
uz: Rasm

# ph_item
source: For example: Phone, bag
ru: Например: Телефон, сумка
uz: Masalan: Telefon, sumka

# ph_item_found
source: For example: Passport, key
ru: Например: Паспорт, ключ
uz: Masalan: Pasport, kalit

# ph_city
source: For example: Samarkand
ru: Например: Самарканд
uz: Masalan: Samarqand

# ph_place_lost
source: Where did you lose it?
ru: Где потеряли?
uz: Qayerda yo‘qotdingiz?

# ph_place_found
source: Where did you find it?
ru: Где нашли?
uz: Qayerdan topdingiz?

# ph_reward
source: 100000 UZS
ru: 100000 сум
uz: 100000 so‘m

# ph_notes
source: Write detailed information
ru: Подробная информация
uz: Batafsil ma’lumot yozing

# ph_name
source: Your name
ru: Ваше имя
uz: Ismingiz

# ph_message
source: Message...
ru: Сообщение...
uz: Xabar...

source: Logout
ru: Выйти
uz: Chiqish

# login_google
source: Login with Google
ru: Войти через Google
uz: google orqali kirish

# chat_error
source: Message cannot be empty
ru: Сообщение не может быть пустым
uz: Xabar bo‘sh bo‘lishi mumkin emas

# chat_sending_error
source: Error sending message:
ru: Ошибка при отправке сообщения:
uz: Xabar yuborishda xato:

# chat_empty
source: No messages yet
ru: Сообщений пока нет
uz: Hozircha xabarlar yo‘q

# chat_hint
source: Type a message...
ru: Напишите сообщение...
uz: Xabar yozing...

# title
source: Hello
ru: Привет
uz: Salom

# description
source: This is a description
ru: Это описание
uz: Bu tavsif

# searchHint
source: Search announcements...
ru: Ищите объявления...
uz: E’lonlarni qidiring...

# noData
source: No announcements found
ru: Объявления не найдены
uz: E’lonlar topilmadi

# lostFormTitle
source: Lost
ru: Потерял
uz: Yo‘qotdim

# foundFormTitle
source: Found
ru: Нашёл
uz: Topdim

source: Item
ru: Предмет
uz: Narsa

# itemHint
source: For example: Black wallet, phone
ru: Например: Чёрный кошелёк, телефон
uz: Masalan: Qora hamyon, telefon

# itemHelper
source: Write exact name: color, brand, model.
ru: Укажите точное название: цвет, бренд, модель.
uz: Aniq nom yozing: rang, firma, model.

# city
source: City/Region
ru: Город/Регион
uz: Shahar/Hudud

# cityHint
source: For example: Samarkand / Registan
ru: Например: Самарканд / Регистан
uz: Masalan: Samarqand / Registon

source: Place
ru: Место
uz: Joy

# placeHint
source: Where did you lose it? (market, bus stop...)
ru: Где потеряли? (рынок, остановка...)
uz: Qayerda yo‘qotdingiz? (bozor, bekat...)

source: Date/Time
ru: Дата/Время
uz: Sana/Vaqt

source: Contact
ru: Контакт
uz: Aloqa

# reward
source: Reward (optional)
ru: Награда (необязательно)
uz: Mukofot (ixt.)

# rewardHint
source: 100000 UZS
ru: 100000 сум
uz: 100000 so‘m

# extra
source: Additional
ru: Дополнительно
uz: Qo‘shimcha

# extraHint
source: Features: sticker, cover, documents inside...
ru: Особенности: наклейка, крышка, внутри документы...
uz: Belgilar: stiker, qopqoq, ichida hujjatlar...

# image
source: Photo
ru: Фото
uz: Rasm

# noFile
source: No file selected
ru: Файл не выбран
uz: Файл не выбран

# chooseAnother
source: Choose another photo
ru: Выбрать другое фото
uz: Boshqa rasm tanlash

# imageRequired
source: Photo selection is required
ru: Выбор фото обязателен
uz: Rasm tanlash majburiy

# submit
source: Submit announcement
ru: Подать объявление
uz: E'lon berish

# foundTitle1
source: Why BINGO?
ru: Почему BINGO?
uz: Nega BINGO?

# foundDescription1
source: Simple form, quick result. All announcements in one place.
ru: Простая форма, быстрый результат. Все объявления в одном месте.
uz: Oddiy forma, tez natija. Barcha e’lonlar bir joyda.

# foundTitle2
source: Quick guide
ru: Краткое руководство
uz: Qisqa yo‘riqnoma

# foundDescription2
source: ❗ Fill out the 'Lost' or ✅ 'Found' form
ru: ❗ Заполните форму 'Потерял' или ✅ 'Нашёл'
uz: ❗ Yo‘qotdim yoki ✅ Topdim formasini to‘ldiring

# btn_share
source: Share
ru: Поделиться
uz: Ulashish

# btn_message
source: Message
ru: Сообщение
uz: Xabar

# register_title
source: Registration
uz: Ro'yxatdan o'tish

# login_title
source: Login
uz: Kirish

source: Password
uz: Parol

source: Confirm Password
uz: Parolni tasdiqlang

# btn_register
source: Register
uz: Ro'yxatdan o'tish

# btn_login
source: Login
uz: Kirish

# have_account
source: Already have an account?
uz: Hisobingiz bormi?

# no_account
source: Don't have an account?
uz: Hisobingiz yo'qmi?

source: Register here
uz: Ro'yxatdan o'ting

source: Login here
uz: Kirish

# email_hint
source: example@mail.com
uz: misol@mail.com

# password_hint
source: Enter password
uz: Parolni kiriting

# confirm_password_hint
source: Re-enter password
uz: Parolni qayta kiriting

# email_required
source: Email is required
uz: Email majburiy

# password_required
source: Password is required
uz: Parol majburiy

# password_mismatch
source: Passwords do not match
uz: Parollar mos kelmaydi

# registration_success
source: Registration successful!
uz: Ro'yxatdan o'tish muvaffaqiyatli!

# login_success
source: Login successful!
uz: Kirish muvaffaqiyatli!

source: Registration error
uz: Ro'yxatdan o'tishda xato

source: Login error
uz: Kirishda xato
